var abz = [
  { id: 'id00',
    name: 'Асфальтосмесительная Установка',
    description: '(описание детали)',
    constructorNumber: '08АБЗ-000.00.00.000'
  },
  { id: 'id01',
    name: 'Бункер готового асфальта',
    description: '(описание детали)',
    constructorNumber: '04АБЗ-001.00.00.000СБ',
    catalogNumber: '4.1.',
    imageMaps: [
      { imageMap: '',
        mapMarkers: [
          { mapMarkerTitle: 'A',
            mapMarkerX: '23',
            mapMarkerY: '45',
            mapMarkerLink: 'nodes.children[0].children[0]'
          }
        ]
      }
    ],
    children: [
      { id: 'id0101',
        name: 'Затвор',
        description: '(описание детали)',
        constructorNumber: '04АБЗ-001.03.00.000СБ',
        catalogNumber: '4.1.3'
      },
      { id: 'id0102',
        name: 'Затвор',
        description: '(описание детали)',
        constructorNumber: '04АБЗ-001.04.00.000СБ',
        catalogNumber: '4.1.4'
      },
      { id: 'id0103',
        name: 'Кронштейн',
        description: '(описание детали)',
        constructorNumber: '04АБЗ-001.06.00.000СБ',
        catalogNumber: '4.1.6'
      },
      { id: 'id0104',
        name: 'Кронштейн',
        description: '(описание детали)',
        constructorNumber: '04АБЗ-001.07.00.000СБ',
        catalogNumber: '4.1.7'
      },
      { id: 'id0105',
        name: 'Подшипник',
        description: '(описание детали)',
        constructorNumber: '',
        catalogNumber: '4.1.49'
      },
      { id: 'id0106',
        name: 'Пневмоцилиндр',
        description: '(описание детали)',
        constructorNumber: '',
        catalogNumber: '6.90.1.51'
      }
    ] // end Uzels array
  },
  { id: 'id02',
    name: 'Устройство разгрузки асфальта',
    description: '(описание детали)',
    children: ''
  },
  { id: 'id03',
    name: 'Бункер негабарита',
    description: '(описание детали)',
    children: ''
  },
  { id: 'id04',
    name: 'Мешалка',
    description: '(описание детали)',
    children: ''
  },
  { id: 'id05',
    name: 'Редуктор',
    description: '(описание детали)',
    children: ''
  },
  { id: 'id06',
    name: 'Весы битумные',
    description: '(описание детали)',
    children: ''
  },
  { id: 'id07',
    name: 'Весы пыли',
    description: '(описание детали)',
    children: ''
  },
  { id: 'id08',
    name: 'Весы минерала',
    description: '(описание детали)',
    children: ''
  },
  { id: 'id09',
    name: 'Весы ВИАТОПа',
    description: '(описание детали)',
    children: ''
  },
  { id: 'id10',
    name: 'Бункер минерала',
    description: '(описание детали)',
    children: ''
  },
  { id: 'id11',
    name: 'Бункер пыли',
    description: '(описание детали)',
    children: ''
  },
  { id: 'id12',
    name: 'Короб грохота',
    description: '(описание детали)',
    children: ''
  },
  { id: 'id13',
    name: 'Вибратор',
    description: '(описание детали)',
    children: ''
  },
  { id: 'id14',
    name: 'Устройство распределительное',
    description: '(описание детали)',
    children: ''
  }
] // end Megauzels array
  // Получать родителя для узлов автоматически, цепочку родителей, хранить в строковом параметре и выдавать в хлебокрошки целиком? Возможно
  // === Выбор узла из маркера на чертеже, ===
  //     как открыть целевой элемент дерева снаружи, без кликов по дереву?

  // Подсветка открытого узла

/*
2.	Устройство разгрузки асфальта		08АБЗ-002.00.00.000СБ	8.2.

  		Затвор	04АБЗ-002.03.00.000СБ	4.2.3.
  		Кронштейн	04АБЗ-021.11.00.000СБ	4.2.11.
  		Пневмоцилиндр - 2шт.		6.90.2.75

  3.	Бункер негабарита		04АБЗ-023.00.00.000СБ	4.23.
  		Короб-затвор	05АБЗ-023.04.00.000СБ	5.23.4.
  		Датчик уровня	08АБЗ-004.05.00.000-С3	8.4.5.
  		Пневмоцилиндр 		4.23.04.17

Устройство смесительное		08АБЗ-003.00.00.000СБ
  4	Мешалка		04АБЗ-003.01.00.000СБ	4.3.1.
  		Вал-1шт.	04АБЗ-003.01.00.019	4.3.1.19
  		Вал-1шт.	04АБЗ-003.01.00.020	4.3.1.20
  		Втулка-4шт.	04АБЗ-003.01.00.021	4.3.1.21
  		Фланец-4шт.	04АБЗ-003.01.00.022А	4.3.1.22
  		Втулка-2шт.	03АБЗ-003.01.00.023	3.3.1.23
  		Втулка-2шт.	04АБЗ-003.01.00.024А	4.3.1.24
  		Отражатель-2шт.	04АБЗ-003.01.00.025	4.3.1.25
  		Шайба-2шт.	03АБЗ-003.01.00.026	3.3.1.26
  		Крышка-2шт.	03АБЗ-003.01.00.027	3.3.1.27
  		Крышка-2шт.	03АБЗ-003.01.00.028	3.3.1.28
  		Крышка-2шт.	03АБЗ-003.01.00.029	3.3.1.29
  		Шкив-1шт.	04АБЗ-003.01.00.030	4.3.1.30
  		Отражатель-2шт.	04АБЗ-003.01.00.032	4.3.1.32
  		Прокладка-12шт.	04АБЗ-003.01.13.004	4.3.1.13.4
  		Кольцо нажимное-4шт.	04АБЗ-003.01.00.058	4.3.1.58
  		Лопасть-12шт.	ЛО К160 М031 М 01	4.3.1.13.3
  		Стойка правая-8шт.	СТ К160М032 R 03	4.3.1.13.2
  		Стойка левая-4шт.	СТ К160М033 L 03	4.3.1.13.1
  		Ступица-8шт.(бугель)	БУ К160 М034 М 03	4.3.1.13.5
  		Болт М20-24шт.		4.3.1.13.7
  		Болт М30-20шт.		4.3.1.13.8
  		Гайка М20-48шт.		4.3.1.13.9
  		Гайка М30-40шт.		4.3.1.13.10
  		Шайба тарельчатая-24шт.		4.3.1.13.11
  		Шайба 30-20шт.		4.3.1.13.12
  		Лист изнашивающийся-30шт.	ЛИ К160 М035 М 01	4.3.1.15.35
  		Лист изнашивающийся-10шт.	ЛИ К160 М036 М 01	4.3.1.15.36
  		Лист изнашивающийся-8шт.	ЛИ К160 М037 М 01	4.3.1.15.37
  		Лист изнашивающийся-4шт.	ЛИ К160 М038 R 01	4.3.1.15.38
  		Лист изнашивающийся-4шт.	ЛИ К160 М039 L 01	4.3.1.15.39
  		Лист изнашивающийся-6шт.	ЛИ К160 М040 М 01	4.3.1.15.40
  		Вставка	04АБЗ-003.01.00.017	4.3.1.15.41
  		Вставка	04АБЗ-003.01.00.017-01	4.3.1.15.42
  		Винт М12-156шт.		4.3.1.15.45
  		Шайба 12.65Г-156шт.		4.3.1.15.46
  		Гайка М12-156шт.		4.3.1.15.47
  		Шайба 12-156шт.		4.3.1.15.48
  		Подшипник -2шт.		4.3.1.120
  		Подшипник -2шт.		4.3.1.121
  		Манжета - 2шт.		4.3.1.126
  		Ремень-12шт.		4.3.1.131
  		Электродвигатель-2шт.		4.3.1.130
  		Пневмоцилиндр-2шт.		6.90.3.132




  5	Редуктор		03АБЗ-003.01.02.000СБ	3.3.1.2.
  		Вал-шестерня(под шкив)-2шт.	03АБЗ-003.01.02.200СБ	3.3.1.2.2
  		Ступица(выходного вала)-2шт.	03АБЗ-003.01.02.300СБ	3.3.1.2.3
  		Сапун-1шт.	03АБЗ-003.10.00.000СБ	3.3.10.21
  		Зубчатый венец-4шт.	03АБЗ-003.01.02.007	3.3.1.2.7
  		Вал-шестерня(промежуточной ступицы-2шт.	03АБЗ-003.01.02.008	3.3.1.2.8
  		Ступица(промежуточная)-2шт.	03АБЗ-003.01.02.015	3.3.1.2.15
  		Шкив-2шт.	04АБЗ-003.01.02.016	4.3.1.2.16
  		Подшипник-2шт.		3.3.1.2.50
  		Подшипник-8шт.		3.3.1.2.51
  		Подшипник-2шт.		3.3.1.2.52
  		Манжета-2шт.		3.3.1.2.55
  		Манжета-2шт.		3.3.1.2.56
  		Шпонка-2шт.		3.3.1.2.58
  		Шпонка-2шт.		3.3.1.2.59
  		Затвор	04АБЗ-003.01.03.000СБ	4.3.1.3
  		Рычаг	04АБЗ-003.01.10.000СБ	4.3.1.10
  		Рычаг	04АБЗ-003.01.11.000СБ	4.3.1.11
  		Короб в сборе	04АБЗ-003.02.00.000СБ	4.3.2.



Устройство взвешивания		08АБЗ-004.00.00.000СБ
  6	Весы битумные		04АБЗ-004.10.00.000СБ	4.4.10.
  		Тензодатчик-2шт.		4.4.10.93
  		Аммортизатор-2шт.		4.4.10.95
  		Нагреватель хомутовый-1шт.		4.4.10.104
  		Пневмоцилиндр-1шт.		6.90.4.106
  		Электронагреватель - 1шт.		4.4.10.108
  		Клапан аварийный	04АБЗ-004.10.03.000СБ	4.4.10.3.

  7	Весы пыли		02АБЗ-004.02.00.000(3)СБ	2.4.2.
  		Тензодатчик-2шт.		2.4.2.93
  		Аммортизатор-2шт.		2.4.2.95
  		Заслонка поворотная-1шт.		2.4.2.97

  8	Весы минерала		04АБЗ-004.03.00.000СБ	4.4.3.
  		Затвор-1шт.	04АБЗ-004.03.01.000-МСБ	4.4.3.1.М
  		Тензодатчик-3шт.		4.4.3.100
  		Аммортизатор-3шт.		4.4.3.103
  		Пневмоцилиндр-1шт		6.90.4.75

  9	  Весы ВИТАТОПа		08АБЗ-004.06.00.000СБ	8.4.6.
  		Тензодатчик-2шт.		8.4.6.67
  		Заслонка поворотная-1шт.		8.4.6.72
  		Демпфер-4шт.	02АБЗ-004.06.00.023(3)-01	2.4.6.23

  10	Бункер минерала		04АБЗ-005.02.00.000СБ	4.5.2.
  		Затвор-5шт.	04АБЗ-004.03.01.000-МСБ	4.4.3.1.М
  		Пневмоцилиндр-5шт		6.90.4.75

  11	Бункер пыли		08АБЗ-005.03.00.000-ВСБ	8.5.3.
  		Заслонка поворотная-1шт.		8.5.3.6
  		Шнек-1шт.	08АБЗ-005.03.01.200-М	8.5.3.1.2
  		Мотор-редуктор-1шт.		8.5.3.1.56
  		Рукав соединит.-1шт.	04АБЗ-004.00.00.018	4.4.18.
  		Рукав соединит.-1шт.	04АБЗ-004.00.00.019	4.4.19.
  		Рукав соединит.-1шт.	04АБЗ-004.00.00.020	4.4.20.
  		Рукав соединит.-1шт.	04АБЗ-004.00.00.021	4.4.21.

  	Промежуточный бункер		04АБЗ-005.00.00.000-М1
  		Ротационный датчик уровня-1шт.	04АБЗ-005.01.13.000СБ-01-М1	4.5.1.13.
  		Ротационный датчик уровня-5шт.	04АБЗ-005.01.14.000СБ-М1	4.5.1.14.
  		Транспортер шнековый-1шт.	04АБЗ-005.02.00.000-М1	4.5.2.М1
  		Мотор-редуктор-1шт.		4.5.2.56
  		Шнек-1шт.	04АБЗ-005.02.02.000СБ-М1	4.5.2.2.М1
  		Цапфа-1шт.	04АБЗ-005.02.02.003-М1	4.5.2.2.3.М1
  		Цапфа-1шт.	04АБЗ-011.01.07.002	4.11.1.7.2
  		Втулка-2шт.	04АБЗ-011.01.07.005	4.11.1.7.5
  		Перо шнека-1шт.	04АБЗ-005.02.02.006-М1	4.5.2.2.6М1
  		Подшипник-2шт.		4.5.2.45
  		Манжета-3шт.		4.5.2.48
  		Шпонка-1шт.		4.5.2.47
  		Набивка-2шт.		4.5.2.50

Грохот		АБЗ-007.00.00.000СБ-М
  12	Короб грохота		АБЗ-007.02.00.000-М1СБ	1.7.2.М1
  		Кожух-54шт.	ГН-001.02.11.000АСБ	1.7.2.2.А
  		Отбойник-1шт.	АБЗ-007.02.03.000СБ	1.7.2.3
  		Балка зацепная-1шт.	АБЗ-007.02.04.000СБ	1.7.2.4
  		Балка опорная-25шт.	АБЗ-007.02.05.000СБ	1.7.2.5
  		Балка натяжная-9шт.	АБЗ-007.02.07.000-М1СБ	1.7.2.7.М1
  		Крюк-54шт.	ГН-001.02.15.000СБ	1.7.2.15.8
  		Сито-1шт.	АБЗ-007.02.09.000СБ	1.7.2.9
  		Сито-1шт.	АБЗ-007.02.09.000-01СБ	1.7.2.10
  		Сито-1шт.	АБЗ-007.02.09.000-02СБ	1.7.2.11
  		Сито-1шт.	АБЗ-007.02.09.000-03СБ	1.7.2.12
  		Сито-1шт.	АБЗ-007.02.09.000-04СБ	1.7.2.13
  		Сито-1шт.	АБЗ-007.02.09.000-05СБ	1.7.2.14
  		Втулка-54шт.	ГН-001.02.17.000	1.7.2.24
  		Шкив-2шт.	АБЗ-007.02.01.009-01-М	1.7.2.1.25.М
  		Электродвигатель-2шт.		1.7.2.50
  		Ремень-6шт.		1.7.2.52
  		Пружина-54шт.	ГН-001.02.00.019	1.7.2.22
  		Пружина-8шт.		1.7.32.
  13	Вибратор		АБЗ-007.02.01.000СБ-М1	1.7.2.1.М1
  		Вал-2шт.	АБЗ-007.02.01.012-М1	1.7.2.1.12.М1
  		Стакан-4шт.	АБЗ-007.02.01.005-М1	1.7.2.1.5.М1
  		Крышка-4шт.	АБЗ-007.02.01.006-М1	1.7.2.1.6.М1
  		Кольцо-4шт.	АБЗ-007.02.01.008-М1	1.7.2.1.8.М1
  		Шкив-2шт.	АБЗ-007.02.01.009-М1	1.7.2.1.9.М1
  		Втулка-4шт.	АБЗ-007.02.01.013-М1	1.7.2.1.13.М1
  		Груз-2шт.	АБЗ-007.02.01.015-М1	1.7.2.1.15.М1
  		Груз-2шт.	АБЗ-007.02.01.015-01-М1	1.7.2.1.16.М1
  		Кольцо-2шт.	АБЗ-007.02.01.017-М1	1.7.2.1.17.М1
  		Шайба-8шт.	АБЗ-007.02.01.018-М1	1.7.2.1.18.М1
  		Подшипник-4шт.		1.7.2.1.35
  		Манжета-8шт.		1.7.2.1.37
  		Кольцо-4шт.		1.7.2.1.39
  		Шпонка-2шт.		1.7.2.1.41
  		Шпонка-4шт.		1.7.2.1.42
  14	Устройство распределительное		АБЗ-007.03.00.000СБ	1.7.3.
  		Рычаг-1шт.	АБЗ-007.03.00.014	1.7.3.14
  		Пошипник-2шт.		1.7.3.47
  		Рукав соединительный-1шт.	АБЗ-007.03.00.015	1.7.3.15
  		Пневмоцилиндр-1шт.		6.90.7.
*/
